blog4/app/views/users/_user.html.erb

SELECT "users".* FROM "users" INNER JOIN "followships" ON "users"."id" = "followships"."following_user_id" WHERE "followships"."user_id" = ?  [["user_id", 1]]
---
      <h1 class="card-title">
        <%= link_to (user.user_name.present? ? user.user_name : "no name yet"), "/users/#{user.id}", class: "no_under_line" %>