blog4/app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)
    @blog.user = current_user

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["content", "1.每天晚上要甜甜的视频哦~\n2.分享日常"], ["updated_at", "2023-10-23 15:02:45.926399"], ["id", 7]]