blog4/app/controllers/comments_controller.rb

  def index
    # @comments = Comment.find_by(params[:blog_id])

    # @blog_comments = Comment.find_by()
     @blog = Blog.find(params[:blog_id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def show
    @blog = Blog.find(params[:blog_id])
    @comments = @blog.comments.find_by(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ? AND (8) LIMIT ?  [["blog_id", 4], ["LIMIT", 1]]

  def new
    @blog = Blog.find(params[:blog_id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @blog = Blog.find(params[:blog_id])
    @comment = Comment.new(comment_params)
    @comment.blog = @blog
    @comment.user = current_user

    respond_to do |format|
      if @comment.save
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("blog_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["blog_id", 4], ["content", "逃课-评论1"], ["created_at", "2023-11-07 07:39:49.942734"], ["updated_at", "2023-11-07 07:39:49.942734"], ["user_id", 3]]

  def destroy
    @blog = @comment.blog
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]