blog4/app/models/user.rb

INSERT INTO "followships" ("user_id", "following_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["following_user_id", 1], ["created_at", "2023-11-07 11:05:50.513064"], ["updated_at", "2023-11-07 11:05:50.513064"]]
---
  def follow(other_user)
    unless self.following?(other_user)
      self.followships.create(following: other_user)#需要是单数following   self用户关注了other_user用户（following）

SELECT "followships".* FROM "followships" WHERE "followships"."user_id" = ? AND "followships"."following_user_id" = ? LIMIT ?  [["user_id", 3], ["following_user_id", 1], ["LIMIT", 1]]
DELETE FROM "followships" WHERE "followships"."id" = ?  [["id", 96]]
---
  def unfollow(other_user)
    followship = self.followships.find_by(following: other_user)#找到这个用户的followship  里面全是self用户关注的各种人 按照following_user查找
    followship.destroy if followship